//=======================================================
// 
// アイテム処理[item.h]
// Author:Rio Ohno
// 
//=======================================================

#include"item.h"

//テクスチャ
static const char* BLOCK_TEXTURE[ITEMTYPE_MAX] =
{
	NULL,
	"data\\TEXTURE\\toge000.png",
};

//グローバル変数宣言
LPDIRECT3DTEXTURE9 g_pTextureItem[ITEMTYPE_MAX] = {};			//テクスチャへのポインタ
LPDIRECT3DVERTEXBUFFER9 g_pVtxBuffItem = NULL;					//頂点バッファへのポインタ
Item g_Item[MAX_ITEM] = {};

//=======================================================
// アイテムの初期化処理
//=======================================================
void InitItem()
{

}

//=======================================================
// アイテムの終了処理
//=======================================================
void UninitItem()
{

}

//=======================================================
// アイテムの更新処理
//=======================================================
void UpdateItem()
{

}

//=======================================================
// アイテムの描画処理
//=======================================================
void DrawItem()
{

}